backend/controllers/LinksController.php

    protected function findModel($id)
    {
        if (($model = FriendLink::findOne($id)) !== null) {
---
SELECT * FROM `cms_friend_link` WHERE `link_id`='4'