backend/controllers/MenuController.php

    protected function findModel($id)
    {
        if (($model = Menu::findOne($id)) !== null) {
---
SELECT * FROM `cms_menu` WHERE `menu_id`='1'