backend/controllers/RoleController.php

SELECT * FROM `cms_role` WHERE `role_id`='1'
---
    protected function findModel($id)
    {
        if (($model = Role::findOne($id)) !== null) {