backend/controllers/RoleactionController.php

    public function actionCreate()
    {
        if (!$this->is_access('roleaction/create')) {
            Yii::$app->session->setFlash('error', $this->errorInfo);
            return $this->redirect($this->redirectUrl);
        }

        $model = new RoleAction();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `cms_role_action` (`action_title`, `action_code`, `parent_id`) VALUES ('添加新链接', 'links/create', 31)

    protected function findModel($id)
    {
        if (($model = RoleAction::findOne($id)) !== null) {
---
SELECT * FROM `cms_role_action` WHERE `action_id`='1'