common/models/CommentArticle.php

SELECT * FROM `cms_comment_article` WHERE (`aid`=4) AND (`status`=1) ORDER BY `id` DESC LIMIT 1 OFFSET 1
---
    public function getArticleList($aid, $p = 1)
    {
        $pageSize = 20;
        $offset = ($p - 1) * $pageSize;
        return $this->find()->where(['aid' => $aid, 'status' => 1])->orderBy('id DESC')->asArray()->offset($offset)->limit($pageSize)->all();

SELECT * FROM `cms_comment_article` WHERE (`uid`=4) AND (`status`=1) ORDER BY `id` DESC LIMIT 20 OFFSET 20
---
    public function getMemberList($uid, $p = 1)
    {
        $pageSize = 20;
        $offset = ($p - 1) * $pageSize;
        return $this->find()->where(['uid' => $uid, 'status' => 1])->orderBy('id DESC')->asArray()->offset($offset)->limit($pageSize)->all();