common/models/MemberRank.php

SELECT * FROM `cms_member` WHERE `uid`=1
SELECT * FROM `cms_member_rank` ORDER BY `score` DESC
---
    public function getMemberRank($uid)
    {
        $uScore = Member::findOne($uid)->score;
        $list = $this->find()->orderBy('score DESC')->all();