common/models/Menu.php

SELECT COUNT(*) FROM `cms_menu` WHERE `pid`=1
---
    public function itemMenu($menu_id)
    {
        return $this->find()->where(['pid' => $menu_id])->count();

SELECT * FROM `cms_menu` WHERE (`pid`=0) AND (`status`=1) ORDER BY `sort`
---
    public function menuTop()
    {
        $menuTop =  $this->find()->where(['pid' => 0, 'status' => 1])->orderBy('sort')->all();

SELECT * FROM `cms_menu` WHERE `status`=1 ORDER BY `sort`
---
    public function menuAll()
    {
        $list = $this->find()->where(['status' => 1])->orderBy('sort')->all();