common/models/RoleAction.php

SELECT * FROM `cms_role_action`
---
    public function getActionTwoItem()
    {
        $list = $this->find()->asArray()->all();

SELECT COUNT(*) FROM `cms_role_action` WHERE `parent_id`=1
---
    public function getNextCount($parent_id = 0)
    {
        return $this->find()->where(['parent_id' => $parent_id])->count();

SELECT * FROM `cms_role_action`
---
    public function treeList()
    {
        $list = $this->find()->asArray()->all();